class window.Gnome extends Creature
  gnom_names = ['Дерин', 'Рерин', 'Фоин', 'Двабур', 'Боин', 'Кифур', 'Неин','Фоли',
                'Фиин', 'Дварин', 'Фефур', 'Дэбур', 'Дели', 'Двабур', 'Туфур', 'Бибур', 'Киин','Фобур',
                'Двали', 'Фафур', 'Киин', 'Дэрин','Дали', 'Бели', 'Фоли']

  gnom_family_names = ['Фифур', 'Бибур', 'Бомбур', 'Баин', 'Дэин', 'Тоин', 'Рерин',
                     'Небур', 'Бафур', 'Рабур', 'Бефур', 'Туин', 'Бирин', 'Баин', 'Рибур', 'Бефур',
                     'Туфур', 'Нерин' , 'Нерин', 'Набур', 'Рурин', 'Фобур', 'Тубур','Кифур', 'Турин']

  getRandomArbitary = (min, max) ->
    return Math.floor(Math.random() * (max - min + 1)) + min

  constructor: () ->
    super(gnom_names[getRandomArbitary(0, 24)] + ' сын ' + gnom_family_names[getRandomArbitary(0, 24)]+'a')
